from aiogram import Router
from aiogram.filters import CommandStart, Command
from aiogram.types import Message

private_router = Router()
group_router = Router()
global_router = Router()

# /start - в личном/групповом чате
@global_router.message(CommandStart())
async def cmd_start(message: Message):
    await message.answer(
        "Привет! 👋\n"
        "Я бот платформы информационного комьюнити ITAcadem на базе StartUP (СИЭУиП).\n"
        "Используй:\n"
        "/info - чтобы узнать обо мне по больше.\n"
        "/help - чтобы посмотреть команды."
    )

# /info - в личном/групповом чате
@global_router.message(Command("info"))
async def cmd_info(message: Message):
    await message.answer(
        "Привет! 👋\n"
        "Я бот платформы информационного комьюнити ITAcadem на базе StartUP (СИЭУиП).\n\n"

        "ITAcadem — это современная образовательная платформа для студентов СИЭУиП и всех, "
        "кто хочет учиться программированию и развиваться в IT-сфере. 💻✨\n"
        "Платформа объединяет практическое обучение, проектную деятельность и профессиональный рост "
        "в единой интерактивной среде.\n\n"

        "Моя задача — сделать твоё развитие удобным, наглядным и доступным в удалённом формате. 🚀\n"
        "Через меня ты можешь проще взаимодействовать с платформой и IT‑сообществом.\n\n"

        "Что я могу предложить уже сейчас:\n"
        " • Просмотр твоего профиля и прогресса в обучении 📊\n"
        " • Отслеживание выполненных задач и текущих активностей ✅\n"
        " • Напоминания о важных дедлайнах и событиях ⏰\n"
        " • Уведомления о мероприятиях и активностях IT‑комьюнити 📅\n\n"

        "По мере развития платформы мои возможности будут расширяться, "
        "а взаимодействие с ITAcadem станет ещё удобнее и полезнее для тебя. 😉\n\n"
        
        "GitHub проекта — https://github.com/NikkiShuRA/PyBot-ITAcadem.git"
    )

# /help - в личном чате
@private_router.message(Command("help"))
async def cmd_help_private(message: Message):
    await message.answer(
        "/start — запустить бота\n"
        "/help — список команд\n"
        "/me — мой профиль\n"
        "/projects — список проектов\n"
        "/tasks — задачи\n"
        "/admin — панель админимтратора"
    )

# /help - в групповом чате
@group_router.message(Command("help"))
async def cmd_help_group(message: Message):
    await message.answer(
        "/start — запустить бота\n"
        "/help — список команд\n"
        "/profile — карточка моего профиля\n"
        "/projects — список проектов\n"
        "/tasks — задачи\n"
        "/points — работа с баллами\n"
    )
